{
  "meta": {
    "title": "Temurning Merosi",
    "period": "1370-1405",
    "description": "Oxirgi buyuk ko'chmanchi bosqinchi va uning imperiyasining muqobil yo'llari",
    "historical_context": "Temur (Temurlan) oxirgi buyuk ko'chmanchi imperiyasini qurdi va Hindistondan Anadolugacha bo'lgan ulkan hududlarni zabt etdi. Uning 1405-yilda Xitoyga yurish paytida kutilmagan o'limi nima bo'lishi mumkinligi haqida savollar qoldirdi.",
    "divergence_point": "1405-yilda Temurning o'limidan keyin yuzaga kelgan vorislik inqirozi va strategik qarorlar"
  },
  "figures": {
    "emir-timur": {
      "name": "Amir Temur (Temurlan)",
      "role": "Temuriylar imperiyasining asoschisi",
      "description": "Oxirgi buyuk ko'chmanchi bosqinchilardan biri. Mo'g'ullar imperiyasini tiklashga intilgan harbiy daho. 🗡️👑"
    },
    "shahrukh": {
      "name": "Shohruh",
      "role": "Temurning vorisi",
      "description": "Temurning eng kichik o'g'li, imperiyani urush mashinasidan san'at va fan markaziga aylantirdi. 🎨📚"
    },
    "ulugh-beg": {
      "name": "Ulug'bek",
      "role": "Astronom shoh",
      "description": "Qilichdan ko'ra yulduzlarni afzal ko'rgan hukmdor. Samarqandda tarixdagi eng buyuk rasadxonalardan birini qurdi. 🔭✨"
    }
  },
  "timelines": {
    "immortal-emir": {
      "title": "O'lmas Amir: Xitoyni zabt etish 🐉⚔️",
      "description": "Agar Temur 1405-yilda kasalligidan sog'ayib qolsa va ulkan qo'shinini Xitoyga boshqarsa nima bo'lar edi?",
      "divergence_description": "Temur Otror shahrida kasalligidan tuzalib ketadi va Xitoyga bosqinchilikni boshlaydi.",
      "events": {
        "survival-1405": {
          "title": "Otrordagi mo'jiza",
          "description": "Temur qishki kasalligidan tuzalib ketadi. Qo'shin tarqalib ketish o'rniga Sharqqa yo'l oladi.",
          "impact": "Xitoyga qarshi yurishlar rejaga ko'ra davom etadi."
        },
        "fall-of-beijing-1407": {
          "title": "Pekinning qulashi",
          "description": "Temuriy kuchlar ustun otliq qo'shin va porox qurollaridan foydalanib, Buyuk Devordan o'tib, Pekinni bosib oladi.",
          "impact": "Min sulolasining tugashi. Xitoyda Temuriylar sulolasining tashkil topishi."
        },
        "silk-road-monopoly-1410": {
          "title": "Ipak yo'li monopoliyasi",
          "description": "Anadoludan Tinch okeanigacha bo'lgan hududlarni nazorat ostiga olib, Temur Ipak yo'li ustidan mutlaq hukmronlik o'rnatadi.",
          "impact": "Yevropa savdodan mahrum bo'ladi, Uyg'onish davri kechiktiriladi. Markaziy Osiyo dunyoning iqtisodiy markazi bo'ladi."
        }
      },
      "consequences": {
        "short_term": "Markaziy Osiyo Yer yuzidagi eng boy mintaqa bo'ladi.",
        "long_term": "Global kuch markazi Osiyoda qoladi. Yevropa mustamlakachiligi hech qachon boshlanmaydi.",
        "global_impact": "Turk-mo'g'ul madaniyati hukmronlik qiladigan butunlay boshqacha zamonaviy dunyo."
      },
      "butterfly": [
        {
          "trigger": "Temurning davomiy hukmronligi Usmonlilarning tiklanishiga to'sqinlik qiladi",
          "consequence": "Usmonlilar imperiyasi kichik beklik bo'lib qoladi yoki yutib yuboriladi."
        }
      ],
      "present_day_status": "Buyuk Temuriylar Federatsiyasi Turkiyadan Koreyagacha cho'zilgan. Samarqand dunyoning fan va madaniyat poytaxti. Yevropa orqada qolgan feodal davlatlar to'plami. Asosiy global til - Chig'atoy turkiy tili. 🕌🌍"
    },
    "unified-succession": {
      "title": "Pax Timuridea: Barqaror imperiya ⚖️🏛️",
      "description": "Agar Temur fuqarolar urushining oldini oluvchi aniq vorislik rejasini o'rnatgan bo'lsa nima bo'lar edi?",
      "divergence_description": "Temur o'limidan oldin aniq voris va ma'muriy tuzilmani tayinlaydi.",
      "events": {
        "council-of-samarkand-1404": {
          "title": "Samarqand Kengashi",
          "description": "Temur barcha o'g'illari va generallarini yig'ib, rasmiy vorislik qonuni va federal boshqaruvni o'rnatadi.",
          "impact": "Tarixan imperiyani vayron qilgan ichki urushlarning oldini oladi."
        },
        "timurid-renaissance-1450": {
          "title": "Temuriylar Uyg'onishi",
          "description": "Barqaror boshqaruv san'at, astronomiya va matematikaning Yevropaga qaraganda ertaroq va kuchliroq rivojlanishiga imkon beradi.",
          "impact": "Ilmiy inqilob 15-asrda Markaziy Osiyoda boshlanadi."
        }
      },
      "consequences": {
        "short_term": "Islom Oltin davri cheksiz davom etadi.",
        "long_term": "Islom asosan konservatizm bilan emas, balki fan va taraqqiyot bilan bog'lanadi.",
        "global_impact": "Zamonaviy fan o'z ildizlarini Italiya yoki Angliyadan emas, Samarqanddan oladi."
      },
      "butterfly": [
        {
          "trigger": "Erta ilmiy uslub erta sanoatlashtirishga olib keladi",
          "consequence": "Sanoat inqilobi 1700-yillarda Markaziy Osiyoda boshlanadi."
        }
      ],
      "present_day_status": "Temuriylar Hamdo'stligi konstitutsiyaviy monarxiya va dunyoning yetakchi superkuchi. U o'zining go'zal bog'-shaharlari va ilg'or kosmik dasturi (Temuriylar qirollik loyihasi bo'lgan Boyqo'ng'ir kosmodromidan uchirilgan) bilan mashhur. 🚀🌌"
    },
    "western-campaign": {
      "title": "Yevropa Balosi ⚔️🏰",
      "description": "Agar Temur Xitoy o'rniga Yevropani tugatish uchun G'arbga burilganida nima bo'lar edi?",
      "divergence_description": "Temur 'Franklar' Min sulolasidan ko'ra kattaroq xavf ekanligiga qaror qiladi.",
      "events": {
        "invasion-of-europe-1403": {
          "title": "Yevropaga bosqin",
          "description": "Usmonlilarni mag'lub etgach, Temur Bosfor bo'g'ozidan Yevropaga o'tadi.",
          "impact": "Sharqiy Yevropa vayron bo'ladi. Vengriya va Avstriya qulaydi."
        },
        "sack-of-rome-1405": {
          "title": "Rimning talon-taroj qilinishi",
          "description": "Temuriy kuchlar Rimga yetib boradi. Papalik tugatiladi.",
          "impact": "Katolik hokimiyatining qulashi. Yevropa kichik bid'at va sarkarda davlatlarga bo'linib ketadi."
        }
      },
      "consequences": {
        "short_term": "Yevropa Uyg'onish davri beshigidayoq bo'g'iladi.",
        "long_term": "Yevropa asrlar davomida texnologik qoloq bo'lib qoladi.",
        "global_impact": "Kashfiyotlar davri bo'lmaydi, Amerika Yevropa tomonidan mustamlakaga aylantirilmaydi."
      },
      "butterfly": [
        {
          "trigger": "Yevropa mustamlakachiligi yo'q",
          "consequence": "Atstek va Ink imperiyalari omon qoladi va mustaqil ravishda modernizatsiya qilinadi."
        }
      ],
      "present_day_status": "Yevropa Oltin O'rdaning qashshoq, agrar vassal davlatlari to'plami. Amerikada modernizatsiya qilingan Atstek va Ink federatsiyalari hukmronlik qilmoqda. Dunyo ko'p qutbli va butunlay boshqacha. 🌎🏛️"
    }
  },
  "interactive_scenarios": [
    {
      "title": "Anqara jangi (1402)",
      "text": "Siz Temursiz. Usmonli sultoni Boyazid I ulkan qo'shin bilan qarshingizda turibdi. U takabbur, lekin qudratli. Sizning josuslaringiz u sizni topish uchun qo'shinlarini toliqtirib yuborganini xabar qilishdi. Qanday jang qilasiz?",
      "choices": [
        {
          "text": "Mahalliy daryoni to'sib qo'ying va ularni chanqoq holda jang qilishga majbur qiling.",
          "consequence": "Usmonli qo'shinlari chanqoqlikdan vahimaga tushadi. Ularning tatar ittifoqchilari siz tomonga o'tadi. Siz hal qiluvchi g'alabaga erishasiz. (Tarixiy)"
        },
        {
          "text": "Fillar bilan markazga to'g'ridan-to'g'ri hujum qiling.",
          "consequence": "Yenicharlar safni ushlab turishadi. Jang qonli durang bilan tugaydi. Boyazid boshqa kuni jang qilish uchun qochib ketadi."
        },
        {
          "text": "Ularni pozitsiyadan chiqarish uchun soxta chekinish qiling.",
          "consequence": "Boyazid bunga aldanmaydigan darajada tajribali. U o'z pozitsiyasini mustahkamlaydi. Anqara qamali oylar davom etadi."
        }
      ]
    },
    {
      "title": "Otrordagi qish (1405)",
      "text": "1405 yil fevral. Buyuk Amir Temur Otrorda o'lim to'shagida yotibdi. Xitoy chegarasi haftalar uzoqlikda. Uning tabiblari xavfli yangi davolashni taklif qilishmoqda. Nima maslahat berasiz?",
      "choices": [
        {
          "text": "Tajribaviy eliksirni qo'llang. Bu uni o'ldirishi yoki qutqarishi mumkin.",
          "consequence": "Eliksir ish berdi! Temur tuzalib, qo'shinini Xitoyga boshlaydi. 'O'lmas Amir' vaqt chizig'i boshlanadi."
        },
        {
          "text": "Unga dam bering va eng yomoniga tayyorlaning. Kotiblarni chaqiring.",
          "consequence": "Temur vafot etadi, lekin so'nggi nafasi bilan aniq vasiyatnoma yozdiradi. 'Birlashgan Vorislik' vaqt chizig'i boshlanadi."
        },
        {
          "text": "Generallarga G'arbga qaytishni maslahat bering. Bu yomon alomat.",
          "consequence": "Qo'shin Xitoy yurishini tashlab, Yevropani vayron qilish uchun qaytadi. 'Yevropa Balosi' vaqt chizig'i boshlanadi."
        }
      ]
    },
    {
      "title": "Harbiy Kengash (1405)",
      "text": "Temur o'ldi. Qo'shin boshliqsiz. Shahzodalar qilichlarini yalang'ochlashmoqda. Siz Bosh Vazirsiz. Kimni qo'llab-quvvatlaysiz?",
      "choices": [
        {
          "text": "Pir Muhammadni, Temurning tayinlangan vorisini qo'llab-quvvatlash.",
          "consequence": "U kuchsiz va uzoqda. Imperiya darhol parchalanadi. (Tarixiy)"
        },
        {
          "text": "Shohruhni, ziyoli o'g'ilni qo'llab-quvvatlash.",
          "consequence": "U Hirotni saqlab qoladi va madaniy oltin davrni boshlaydi, ammo harbiy ustunlikni yo'qotadi."
        },
        {
          "text": "Xalil Sultonni, xarizmatik jangchini qo'llab-quvvatlash.",
          "consequence": "U Samarqandni egallaydi, lekin xazinani sevgi va urushga sovuradi."
        }
      ]
    },
    {
      "title": "Astronomning Tanlovi (1449)",
      "text": "Siz Temurning nabirasi Ulug'beksiz. Siz ajoyib olimsiz, lekin yomon generalsiz. O'g'lingiz Abdullatif sizning rasadxonangizni yomon ko'radigan diniy radikallar yordamida isyon ko'tarmoqda. Nima qilasiz?",
      "choices": [
        {
          "text": "Taslim bo'lish va Makkaga hajga borishga ruxsat so'rash.",
          "consequence": "O'g'lingiz yo'lda sizni o'ldirtiradi. Rasadxonangiz vayron qilinadi. (Tarixiy)"
        },
        {
          "text": "Sodiq qo'shinlaringizni to'plang va kurashing. Ilm aqidaparaslikdan ustun kelishi kerak!",
          "consequence": "Siz qonli fuqarolar urushida g'alaba qozonasiz. Temuriylar Uyg'onishi davom etadi va erta ilmiy inqilobga olib keladi."
        },
        {
          "text": "Yulduz jadvallaringiz va kitoblaringiz bilan Xitoyga qoching.",
          "consequence": "Sizni Min imperatori kutib oladi. Sizning bilimingiz Xitoy ilmiy oltin davrini boshlab beradi."
        }
      ]
    }
  ]
}